# Modelo de practica
### Mateo Orozco Baldovino

Este modelo sera de practica para aplicar los conceptos de Machine Learning

Para este modelo estoy utilizando un entorno de conda con python 3.11 y voy a utilizar la base de datos del Titanic

# Challenge

Build a predictive model that answers the question: "What sort of people were more likely to survive the Titanic sinking?"

# Data

Train.csv will contain the details of a subset of the passengers on board (891 to be exact) and importantly, will reveal whether they survived or not, also known as the “ground truth”.
The test.csv dataset contains similar information but does not disclose the “ground truth” for each passenger. It’s your job to predict these outcomes.

In [ ]:
# Importamos las librerias principales pero previamente se deben haber instalado los paquetes de conda para el funcionamiento en jupyter
"""
conda create -n titanic python=3.11
conda install ipykernel
conda install pandas

"""
import pandas as pd
import numpy as np

In [5]:
# Se importa la base de datos a trabajar
df = pd.read_csv("C:/Users/Mateo/Documents/Especialidad/MachineLearning/Datos/Titanic/Titanic-Dataset.csv")
# Se imprimen las 5 primeras filas
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
# Ver la cantidad de datos faltantes
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
# Identificar datos duplicados
df.duplicated().sum()

np.int64(0)

In [15]:
# Ver la cantidad de datos en el dataset. Filas y columnas
print(f"Numero de filas: {len(df)}")
print(f"Numero de columnas: {len(df.columns)}")

Numero de filas: 891
Numero de columnas: 12